Revit 2027 API
UIApplication Constructor
 Use a database level Application to construct a UI-level Application.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public UIApplication(
	Application revitApp
)
Public Sub New (
	revitApp As Application
)
public:
UIApplication(
	Application^ revitApp
)
new :
        revitApp : Application -> UIApplication
Parameters
revitApp Application
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the Application argument is a null pointer.
See Also
Reference
UIApplication Class
Autodesk.Revit.UI Namespace